import pytest
import pandas as pd


@pytest.fixture
def sample_data():
    """Тестовые данные"""
    return pd.DataFrame({
        "Дата операции": [
            "29.01.2020 16:03:52",
            "28.01.2020 13:28:47",
            "24.12.2019 19:16:06"
        ],
        "Категория": ["Переводы", "Переводы", "Еда"],
        "Сумма операции": [-10.00, 300.00, -968.00]
    })


@pytest.fixture
def result_fixture():
  return {
  "greeting": "Добрый вечер!",
  "date": "2019-11-12 17:10:35",
  "filtered_by_date_operations": [
    {
      "Дата операции": "12.11.2019 15:57:16",
      "Дата платежа": "14.11.2019",
      "Номер карты": "*4556",
      "Статус": "OK",
      "Сумма операции": -27.9,
      "Валюта операции": "RUB",
      "Сумма платежа": -27.9,
      "Валюта платежа": "RUB",
      "Кэшбэк": 1.0,
      "Категория": "Супермаркеты",
      "MCC": 5411.0,
      "Описание": "SPAR",
      "Бонусы (включая кэшбэк)": 1,
      "Округление на инвесткопилку": 0,
      "Сумма операции с округлением": 27.9
    },
    {
      "Дата операции": "12.11.2019 15:50:37",
      "Дата платежа": "14.11.2019",
      "Номер карты": "*4556",
      "Статус": "OK",
      "Сумма операции": -82.0,
      "Валюта операции": "RUB",
      "Сумма платежа": -82.0,
      "Валюта платежа": "RUB",
      "Кэшбэк": 4.0,
      "Категория": "Транспорт",
      "MCC": 4121.0,
      "Описание": "Яндекс Такси",
      "Бонусы (включая кэшбэк)": 4,
      "Округление на инвесткопилку": 0,
      "Сумма операции с округлением": 82.0
    }],
    "currency_rates": [
      {
        "currency": "USD",
        "rate": 81.299292
      },
      {
        "currency": "EUR",
        "rate": 94.242586
      }
    ],
    "stocks": [
      {
        "ticker": "AAPL",
        "price": 275.25
      },
      {
        "ticker": "AMZN",
        "price": 249.1
      },
      {
        "ticker": "GOOGL",
        "price": 291.31
      },
      {
        "ticker": "MSFT",
        "price": 508.68
      },
      {
        "ticker": "TSLA",
        "price": 439.62
      }
    ]
  }

@pytest.fixture
def operation_from_excel():
  return [{'Дата операции': '15.07.2019 16:50:10', 'Дата платежа': '17.07.2019', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -114.19, 'Валюта операции': 'RUB', 'Сумма платежа': -114.19, 'Валюта платежа': 'RUB', 'Кэшбэк': None, 'Категория': 'Супермаркеты', 'MCC': 5499.0, 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': 2, 'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 114.19}]